//==============================================================================
// EmptyBlockRotation(空塞表)モジュールヘッダ
//==============================================================================
#ifndef _EMPTY_BLOCK_ROTATION_H_            // 二重インクルード防止
#define _EMPTY_BLOCK_ROTATION_H_            // 二重インクルード防止

//==============================================================================
// インクルードファイル
//==============================================================================
#include "EmptyBlock.h"

//==============================================================================
// クラス定義
//==============================================================================
//------------------------------------------------------------------------------
// EmptyBlockRotation例外クラス
//------------------------------------------------------------------------------
class EmptyBlockRotationException : public Exception
{
public:
    //--------------------------------------------------------------------------
    // コンストラクタ
    //--------------------------------------------------------------------------
    EmptyBlockRotationException(std::string format, ...)
        : Exception()
    {
        // メッセージ生成
        va_list ap;
        va_start(ap, format);
        this->SetMessage(format, ap);
        va_end(ap);
    };
};

//------------------------------------------------------------------------------
// EmptyBlockクラス
//------------------------------------------------------------------------------
class EmptyBlockRotation : public EmptyBlock {
private:
    int64_t m_Rotation;                     // ローテーション値

public:
    //--------------------------------------------------------------------------
    // コンストラクタ
    //--------------------------------------------------------------------------
    EmptyBlockRotation(int64_t capacity) : EmptyBlock(capacity)
    {
        // 初期化
        this->m_Rotation = 0;
    }

    //--------------------------------------------------------------------------
    // コンストラクタ
    //--------------------------------------------------------------------------
    EmptyBlockRotation(const EmptyBlockRotation& emptyblock) : EmptyBlock(emptyblock)
    {
        // 設定
        this->m_Rotation = emptyblock.m_Rotation;
    }

    //--------------------------------------------------------------------------
    // デストラクタ
    //--------------------------------------------------------------------------
    virtual ~EmptyBlockRotation()
    {
    }

    //--------------------------------------------------------------------------
    // 検索
    //--------------------------------------------------------------------------
    int64_t Find()
    {
        // 検索結果返却
        return EmptyBlock::Find(this->m_Rotation);
    }

    //--------------------------------------------------------------------------
    // 閉塞
    //--------------------------------------------------------------------------
    int64_t Occlusion()
    {
        // 排他
        this->Lock();

        // 検索
        int64_t _position = this->Find();

        // 検索結果判定
        if(_position < 0)
        {
            // 排他解除
            this->Unlock();

            // 塞がり(空きなし)
            return _position;
        }

        // 排他解除
        this->Unlock();

        // 閉塞
        if(EmptyBlock::Occlusion(_position) != 1)
        {
            // 異常終了
            return -1;
        }

        // ローテーション値更新
        this->m_Rotation = _position + 1;

        // 閉塞位置返却
        return _position;
    }
};
#endif                                      // 二重インクルード防止
