//-----------------------------------------------------------------------------
// timerヘッダ
//-----------------------------------------------------------------------------
#ifndef _TIMER_HPP
#define _TIMER_HPP

//-----------------------------------------------------------------------------
// インクルードファイル
//-----------------------------------------------------------------------------
#include <stdint.h>
#include <sys/time.h>
#include <string.h>

//-----------------------------------------------------------------------------
// クラス定義
//-----------------------------------------------------------------------------
class timer {
private :
    // 開始時間
    struct timeval m_start;
    // 終了時間
    struct timeval m_stoped;
public :
    // コンストラクタ
    timer();
    // デストラクタ
    ~timer();

    // 開始
    void start();
    // 終了
    void stop();

    // 経過時間
    double elapsed();
    // 経過時間
    double elapsed(struct timeval, struct timeval);
};
#endif
